src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИзвещенияОбИзменениях/ИзвещенияОбИзменениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзвещенияОбИзменениях</name>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Извещение</name>
    <type>
      <types>CatalogRef.ИзвещенияОбИзменениях</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыТоваров/СтатусыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТоваров</name>
  <enumValues>
    <name>Производимый</name>
  </enumValues>
  <enumValues>
    <name>НеПроизводимый</name>
  </enumValues>
  <enumValues>
    <name>СнимаемыйСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>Опытный</name>
  </enumValues>
  <enumValues>
    <name>Проектный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМПЗ</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Неликвид</name>
  </enumValues>
  <enumValues>
    <name>ПроблеммыЛогистики</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Материалы/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.Операции.Видимость = РольДоступна("Администратор") или РольДоступна("ВводДанных"); 
КонецПроцедуры

&НаКлиенте
Процедура Применение(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.ДеревоЭтапов",Новый Структура("Номенклатура,НаДату,Предыдущий",Элементы.Список.ТекущаяСтрока,ТекущаяДата(),Ложь));
	Если Результат <> Неопределено Тогда
	ТекФорма = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка");
	ТекФорма.Открыть();
	ТекФорма.Элементы.Список.ТекущаяСтрока = Результат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Если Элементы.Список.ТекущиеДанные.Свойство("ИмяФайла") Тогда
		Элементы.ОбщаяКомандаОткрытьФайл.Доступность = Не Элементы.Список.ТекущиеДанные.ИмяФайла.Пустая();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзмененияПараметров(Команда)
ОткрытьФорму("Обработка.ЗагрузкаПараметровМатериалов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзмененияПараметровСклад(Команда)
ОткрытьФорму("Обработка.ЗагрузкаПараметровМатериаловСклад.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКратностьЗаготовок(Команда)
ОткрытьФорму("Обработка.ЗагрузкаКратностиЗаготовок.Форма");
КонецПроцедуры

&НаСервере
Процедура УдалитьИзАналоговНаСервере(ВыбМПЗ) 
ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиМПЗ(ВыбМПЗ);
	Для каждого ТЧ Из ТаблицаАналогов Цикл
	РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
	РАНР.Период = ТекущаяДата();
	РАНР.Владелец = ТЧ.Ссылка.Владелец;
	РАНР.АналогНормыРасходов = ТЧ.Ссылка;
	РАНР.Норма = 0;
	РАНР.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзАналогов(Команда)
УдалитьИзАналоговНаСервере(Элементы.Список.ТекущаяСтрока);
Предупреждение("Операция завершена!",10);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоМестамХранения(Команда)
ИмяОтчета = "ОтчётПоРегиструМестаХранения";
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,ТекущаяДата(),ТекущаяДата(),Новый Структура("МПЗ",Элементы.Список.ТекущаяСтрока),"ОстаткиПоСкладам"));
ПараметрыФормы.Вставить("КлючВарианта","ОстаткиПоСкладам"); 
ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзмененияСтатусов(Команда)
ИмяОтчета = "ОтчетПоРегиструСтатусыМПЗ";
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,НачалоГода(ТекущаяДата()),ТекущаяДата(),Новый Структура("МПЗ",Элементы.Список.ТекущаяСтрока),"Основной"));
ПараметрыФормы.Вставить("КлючВарианта","Основной"); 
ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура РасположениеНаСкладе(Команда)
ИмяОтчета = "ОтчетПоРегиструЯчейкиХранения";
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,ТекущаяДата(),ТекущаяДата(),Новый Структура("МПЗ",Элементы.Список.ТекущаяСтрока),"ПоМПЗ"));
ПараметрыФормы.Вставить("КлючВарианта","ПоМПЗ"); 
ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппуМатериалов(Мат)
	Если Мат.ЭтоГруппа Тогда
	Возврат(Мат);	
	Иначе	
	Возврат(Мат.Родитель);
	КонецЕсли; 	
КонецФункции

&НаКлиенте
Процедура ОценкаПоКритериям(Команда)
ОткрытьФорму("Обработка.ОценкаПоКритериям.Форма",Новый Структура("ГруппаМатериалов",ПолучитьГруппуМатериалов(Элементы.Список.ТекущаяСтрока)));
КонецПроцедуры

&НаКлиенте
Процедура РасширенныйПоискМатериалов(Команда)
ОткрытьФорму("Обработка.РасширенныйПоискМатериалов.Форма");
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере(Владелец,TYPE,NAME,NUM,POSITION,DEFIN)
ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов[СокрЛП(TYPE)];
	Если ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Материал Тогда
	Выбор = Справочники.Материалы.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике материалов!");
		Возврат;
		КонецЕсли; 
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Деталь Тогда
	Выбор = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике номенклатуры!");
		Возврат;
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Узел Тогда
	Выбор = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике номенклатуры!");
		Возврат;
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
	Выбор = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике номенклатуры!");
		Возврат;
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
	Выбор = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике номенклатуры!");
		Возврат;
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.ТехОперация Тогда
	Выбор = Справочники.ТехОперации.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике тех. операций!");
		Возврат;
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.ТехОснастка Тогда
	Выбор = Справочники.ТехОснастка.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике тех. оснастки!");
		Возврат;
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Документ Тогда
	Выбор = Справочники.Документация.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике документации!");
		Возврат;
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Программа Тогда		
	Выбор = Справочники.Документация.НайтиПоНаименованию(СокрЛП(NAME),Истина);
		Если Выбор.Пустая() Тогда
        Сообщить(NAME + " - не найден в справочнике документации!");
		Возврат;
		КонецЕсли;
	Иначе
	Возврат;
	КонецЕсли;
ТЧ = Справочники.НормыРасходов.СоздатьЭлемент();
ТЧ.Владелец = Владелец;
ТЧ.ВидЭлемента = ВидЭлемента;
ТЧ.Элемент = Выбор;
ТЧ.Наименование = ""+ВидЭлемента+", "+СокрЛП(Выбор.Наименование);
ТЧ.Позиция = POSITION;
ТЧ.Примечание = DEFIN;
ТЧ.Записать();
РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
РНР.Период = ТекущаяДата();
РНР.Владелец = ТЧ.Владелец;
РНР.Элемент = ТЧ.Элемент;
РНР.НормаРасходов = ТЧ.Ссылка;
РНР.Норма = NUM;       
РНР.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСпецификациюИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл с эскизом спецификации");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм расходов из файла..."); 
		ДобавитьНаСервере(Элементы.Список.ТекущаяСтрока,ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value,ExcelЛист.Cells(к,4).Value,ExcelЛист.Cells(к,1).Value,ExcelЛист.Cells(к,6).Value);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрИзвещений(Команда)
ОткрытьФорму("Отчет.ПросмотрИзвещений.Форма.ФормаОтчета",Новый Структура("Элемент",Элементы.Список.ТекущаяСтрока));
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзвещениеНаСервере(Материал,ВыбИзвещение)
Извещение = РегистрыСведений.ИзвещенияОбИзменениях.СоздатьМенеджерЗаписи();
Извещение.Период = ТекущаяДата();
Извещение.Элемент = Материал;
Извещение.Извещение = ВыбИзвещение;
Извещение.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзвещение(Команда)
ФормаИзвещения = ПолучитьФорму("Справочник.ИзвещенияОбИзменениях.ФормаВыбора");
Результат = ФормаИзвещения.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	ДобавитьИзвещениеНаСервере(Элементы.Список.ТекущаяСтрока,Результат);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьТовар(Наименование)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Товары КАК Товары
	|ГДЕ
	|	Товары.ЭтоГруппа = ЛОЖЬ
	|	И Товары.ПометкаУдаления = ЛОЖЬ
	|	И Товары.Наименование = &Наименование";	
Запрос.УстановитьПараметр("Наименование", Наименование);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(Справочники.Товары.ПустаяСсылка());
КонецФункции 

&НаСервере
Процедура ПрисвоитьТоварыНаСервере(ГруппаМатериалов)
Выборка = Справочники.Материалы.ВыбратьИерархически(ГруппаМатериалов);
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ЭтоГруппа Тогда	
			Если Выборка.Товар.Пустая() Тогда
			Товар = ПолучитьТовар(СокрЛП(Выборка.Наименование));
				Если Не Товар.Пустая() Тогда
				Мат = Выборка.ПолучитьОбъект();
				Мат.Товар = Товар;
				Мат.Записать();             
					Если Найти(ПолучитьВерхнегоРодителя(Выборка.Ссылка).Наименование,"Товары для перепродажи") = 0 Тогда
					Продолжить;
					КонецЕсли;
			    СтатусМПЗ = ПолучитьСтатус(Выборка.Ссылка);
					Если Товар.Статус = Перечисления.СтатусыТоваров.НеПроизводимый Тогда
						Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.Запрещённая Тогда
						СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
						СтатусыМПЗ.Период = ТекущаяДата();
						СтатусыМПЗ.МПЗ = Выборка.Ссылка;
						СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.Запрещённая;
						СтатусыМПЗ.Записать(Истина);  					
						КонецЕсли;
					ИначеЕсли Товар.Статус = Перечисления.СтатусыТоваров.СнимаемыйСПроизводства Тогда
						Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ДоИсчерпанияЗапасов Тогда
						СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
						СтатусыМПЗ.Период = ТекущаяДата();
						СтатусыМПЗ.МПЗ = Выборка.Ссылка;
						СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ДоИсчерпанияЗапасов;
						СтатусыМПЗ.Записать(Истина);			
						КонецЕсли;
					ИначеЕсли Товар.Статус = Перечисления.СтатусыТоваров.Производимый Тогда
						Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.Основная Тогда
						СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
						СтатусыМПЗ.Период = ТекущаяДата();
						СтатусыМПЗ.МПЗ = Выборка.Ссылка;
						СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.Основная;
						СтатусыМПЗ.Записать(Истина);			
						КонецЕсли;
					ИначеЕсли Товар.Статус = Перечисления.СтатусыТоваров.Опытный Тогда
						Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ОНР Тогда
						СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
						СтатусыМПЗ.Период = ТекущаяДата();
						СтатусыМПЗ.МПЗ = Выборка.Ссылка;
						СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ОНР;
						СтатусыМПЗ.Записать(Истина);			
						КонецЕсли;
					ИначеЕсли Товар.Статус = Перечисления.СтатусыТоваров.Проектный Тогда
						Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ОНР Тогда
						СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
						СтатусыМПЗ.Период = ТекущаяДата();
						СтатусыМПЗ.МПЗ = Выборка.Ссылка;
						СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ОНР;
						СтатусыМПЗ.Записать(Истина);			
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьТовары(Команда)
ПрисвоитьТоварыНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКорневыеХарактеристики(Команда)
ОткрытьФорму("Обработка.ЗагрузкаКорневыхХарактеристикМатериала.Форма",Новый Структура("Материал",Элементы.Список.ТекущаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусыМатериалов(Команда)
ОткрытьФорму("Обработка.ИзменениеСтатусовМатериалов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияЦенПоследнихЗакупок(Команда)
ИмяОтчета = "ДетализацияЦенПоследнихЗакупок";
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,НачалоМесяца(ТекущаяДата()),КонецМесяца(ТекущаяДата()),Новый Структура("МПЗ",Элементы.Список.ТекущаяСтрока),"Основной"));
ПараметрыФормы.Вставить("КлючВарианта","Основной"); 
ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);		
КонецПроцедуры
